/* напишите программу вычисляющую среднее арифметическое двух чисел */

#include <iostream>
using namespace std;

void main()
{
	// задаем произвольные числа
	int a = 8, b = 7;
	// выводим результат
	cout << (float)(a + b) / 2 << endl;
}